
clear,clc,close all;
deg=pi/180;
% DH参数  [a d theta alpha offset]
DH=[0.33,-0.645,0,0,0;    
    1.15,0.645,0,pi/2,pi/2;
    1.22,0.115,0,0,0;
    0.215,0.17415,0,0,pi/2;
    0,0.11985,0,pi/2,0;
    0,0.11655,0,-pi/2,0];
% 惯性张量
I{1}=[0 0 0; 0 0 0; 0 0 31.5036];
I{2}=[6.2592 0 0; 0 58.4716 0; 0 0 57.2575];
I{3}=[21.8166 0 0; 0 3.5965 0; 0 0 21.4350];
I{4}=[2.9383 0 0; 0 2.8319 0; 0 0 0.3549];
I{5}=[0 0 0; 0 0 0; 0 0 0];
I{6}=[0 0 0; 0 0 0; 0 0 0];
% 连杆质量
m=[372.27 232.06 202.83 66.0035248 0 0];  
% 连杆质心位置
r= { [0.0347521;0.0079348;-0.236716];
    [0.486870972;0;-0.117636803];
    [0.163764236; -0.115; 0.163764236];
    [0;0;-0.300590996];
     [0;0;0];
     [0;0;0]};
% 电机转子转动惯量
Jm=[0.00469,0.0066,0.0066,0.0014,0.0014,0.0014];
% 粘性阻尼系数
B=[599.361/(256.857^2),476.578/(269.176^2),374.719/(251.333^2),...
    56.835/(188.855^2),126.935/(190.192^2),126.084/(131.340^2)];
% 静摩擦力系数
Tc=[323.836/256.857,-323.836/256.857;
    632.69/269.176,-632.69/269.176;
    451.073/251.333,-451.073/251.333;
    126.608/269.176,-126.608/269.176;
    86.797/190.192,-86.797/190.192;
    28.362/131.340,-28.362/131.340;]
% 建立机器人DH参数，初始状态为竖直状态
L(1)=Link('d',-0.645,'a',0.33,'alpha',0,'modified',...
    'I', I{1}, ...
    'r', r{1}, ...%表示连杆质心相对于当前连杆坐标系的位置
    'm', m(1), ...
    'Jm', Jm(1), ...%电机相关的参数  电机转动惯量
    'G', 1, ...%电机减速比
    'B', B(1), ...%粘性摩擦系数
    'Tc', Tc(1,:), ...%库伦摩擦力矩
    'qlim', [-180 180]*deg );%关节限制);
L(2)=Link('d',0.645,'a',1.15,'alpha',pi/2,'offset',pi/2,'modified',...
        'I', I{2}, ...
    'r', r{2}, ...%表示连杆质心相对于当前连杆坐标系的位置
    'm', m(2), ...
    'Jm', Jm(2), ...%电机相关的参数  电机转动惯量
    'G', 1, ...%电机减速比
    'B', B(2), ...%粘性摩擦系数
    'Tc', Tc(2,:), ...%库伦摩擦力矩
    'qlim', [-180 180]*deg );%关节限制););
L(3)=Link('d',0.115,'a',1.22,'alpha',0,'modified',...
        'I', I{3}, ...
    'r', r{3}, ...%表示连杆质心相对于当前连杆坐标系的位置
    'm', m(3), ...
    'Jm', Jm(3), ...%电机相关的参数  电机转动惯量
    'G', 1, ...%电机减速比
    'B', B(3), ...%粘性摩擦系数
    'Tc', Tc(3,:), ...%库伦摩擦力矩
    'qlim', [-180 180]*deg );%关节限制););
L(4)=Link('d',0.17415,'a',0.57133,'alpha',0,'offset',pi/2,'modified',...
        'I', I{4}, ...
    'r', r{4}, ...%表示连杆质心相对于当前连杆坐标系的位置
    'm', m(4), ...
    'Jm', Jm(4), ...%电机相关的参数  电机转动惯量
    'G', 1, ...%电机减速比
    'B', B(1), ...%粘性摩擦系数
    'Tc', Tc(4,:), ...%库伦摩擦力矩
    'qlim', [-180 180]*deg );%关节限制););
L(5)=Link('d',0.11985,'a',0,'alpha',pi/2,'modified',...
        'I', I{5}, ...
    'r', r{5}, ...%表示连杆质心相对于当前连杆坐标系的位置
    'm', m(5), ...
    'Jm', Jm(5), ...%电机相关的参数  电机转动惯量
    'G', 1, ...%电机减速比
    'B', B(5), ...%粘性摩擦系数
    'Tc', Tc(5,:), ...%库伦摩擦力矩
    'qlim', [-180 180]*deg );%关节限制););
L(6)=Link('d',0.11655,'a',0,'alpha',-pi/2,'modified',...
        'I', I{6}, ...
    'r', r{6}, ...%表示连杆质心相对于当前连杆坐标系的位置
    'm', m(6), ...
    'Jm', Jm(6), ...%电机相关的参数  电机转动惯量
    'G', 1, ...%电机减速比
    'B', B(6), ...%粘性摩擦系数
    'Tc', Tc(6,:), ...%库伦摩擦力矩
    'qlim', [-180 180]*deg );%关节限制););
 
robot=SerialLink(L,'name','Arm6');
q=[90   -57.2  73.2  -40   -60  0]*pi/180;
robot.plot(q); %显示三维动画
robot.teach();
forwarda=robot.fkine(q)
qd=[90   90  90  90   90  90]*pi/180;
qdd=[140   320  430  30   40  20]*pi/180;
joint_old=[0   0  0  0   0  0];

F=[0,0,0,0,0,0];
Q = robot.rne(q,qd,qdd,[0,0,9.8],F)
G=[0,0,9.8]';
CenP=r;
n=6;
Fext=F;

Tor=NewtonEulerDyns(DH,q,qd,qdd,m,I,CenP,Jm,B,Tc,G,Fext,n,1)
