%牛顿欧拉法进行计算
% 这里先计算关节的速度 加速度角速度
clear

q1=10*pi/180;
q2=20*pi/180;
qp1=30*pi/180;
qp2=40*pi/180;
qpp1=80*pi/180;
qpp2=80*pi/180;

q=[q1,q2,0];
qd=[qp1,qp2,0];
qdd=[qpp1,qpp2,0];
a1=0.12;
a2=0.10;
m1=0.5;
m2=0.3;
g=9.8;
I1=[-2.782 0.086 -0.8413; 0.086 0 -0.1364; -0.8413 -0.1364 2.4741];
I2=[-0.6741 -0.3658 0.0373; -0.3658 0 0.0377; 0.0373 0.0377 1.0102];
I{1}=I1;
I{2}=I2;
I{3}=[0,0,0;0,0,0;0,0,0];
m(1)=m1;
m(2)=m2;
m(3)=0;
r1=[0.06,0,0];
r2=[0.05,0,0];
deg=pi/180;
Jm=[0,0,0];
B=[0,0,0];
Tc=[0,0;0,0;0,0];
CenP{1}=r1';
CenP{2}=r2';
CenP{3}=[0,0,0]';
%%DH参数表：alpha    a    theta    d
DH =    [0  0    0  0 0;
         0  0  a1  pi/2 0;
         0   0 a2   0 0];
%theta,d,a,alpha

L0 = Revolute('d', 0, 'a', 0, 'alpha', 0,'modified', ...%standard  modeifd
    'I', I1, ...
    'r', r1, ...%表示连杆质心相对于当前连杆坐标系的位置
    'm', m1, ...
    'Jm', 0.000, ...%电机相关的参数  电机转动惯量
    'G', 0, ...%电机减速比
    'B', .0, ...%粘性摩擦系数
    'Tc', [0.0 0.0], ...%库伦摩擦力矩
    'qlim', [-105 105]*deg );%关节限制  

L1 = Revolute('d', 0, 'a', a1, 'alpha', pi/2,'modified', ...%standard  modeifd
    'I', I2, ...
    'r', r2, ...%表示连杆质心相对于当前连杆坐标系的位置
    'm', m2, ...
    'Jm', 0.000, ...%电机相关的参数  电机转动惯量
    'G', 0, ...%电机减速比
    'B', .0, ...%粘性摩擦系数
    'Tc', [0.0 0.0], ...%库伦摩擦力矩
    'qlim', [-105 105]*deg );%关节限制  



L2 = Revolute('d', 0, 'a', a1, 'alpha', 0,'modified', ...%standard  modeifd
    'I',  [0,0,0;0,0,0;0,0,0], ...
    'r', [0,0,0], ...%表示连杆质心相对于当前连杆坐标系的位置
    'm', 0, ...
    'Jm', 0.000, ...%电机相关的参数  电机转动惯量
    'G', 0, ...%电机减速比
    'B', .0, ...%粘性摩擦系数
    'Tc', [0.0 0.0], ...%库伦摩擦力矩
    'qlim', [-105 105]*deg );%关节限制  


UR=SerialLink([L0,L1,L2],'name','robotright');
UR.teach()
fext = [0,0,0, 0, 0, 0];
Q = UR.rne(q, qd, qdd, [0, 9.8, 0], fext)
TF=Tc;
G=[0,9.8,0]';
g=G
n=3;
mode=1;
Tor=NewtonEulerDyns(DH,q,qd,qdd,m,I,CenP,Jm,B,TF,G,fext,n,mode)